def madlib():

    나라 = input("온 나라는 뭘까요?: ")
    이름은 = input("이름이 어떻게 되세요?: ")
    다니는_대학 = input("무슨 대하에 다니고 있을까요?: ")
    동사 = input("동사: ") #use 늘었다 아님 (발전하다) or if you want use 절대 발전하지 않다 ㅋㅋㅋㅋ
    취미1 = input("취미: ")
    취미2 = input("취미: ")

#자기소개 한국말로 매드립 (잘 쓰는거 아니라, 코딩에 더 집중해서 잘 쓸 수 있을지도 모르겠지만 어쨌든.. 
# 재밌게 보고 합니다!)


    madlib = f"안녕하세요 여러분! 저는 {나라} {이름은}입니다.전 한국인 아니지만 \
    외국인치곤 한국어 어느정도 말할 수 있고요 왜냐 제 주변에선 한국인들이 넘 많아서 \
    시간이 지날수록 한국어를 조금 배우게 됐구요 쓰는 기회도 많아져서 실력도 좀 {동사}.\
    여유가 있을때마다 숙제도 하지 않으면서 제가 {취미1} 아님 {취미2} 많이 합니다. \
    - 미국인의 한국말로 쓰는 매드립 (Python으로)." ##개인적인 매드립 ㅋㅋ
    
    print(madlib)
